let total = "количество товаров на складе";
let ordered = "единиц товара в заказе";
let result;

total = 100;
ordered = 20;
result = 100 < 20 ? "На складе недостаточно твоаров!" : "Заказ оформлен, с вами свяжется менеджер";
console.log(result);

ordered= 80;
result = 100 < 80 ? "На складе недостаточно твоаров!" : "Заказ оформлен, с вами свяжется менеджер";
console.log(result);

ordered= 130;
result = 100 < 130 ? "На складе недостаточно твоаров!" : "Заказ оформлен, с вами свяжется менеджер";
console.log(result);


// if (total < ordered) {
//   result = "На складе недостаточно твоаров!";
//  } else {result = "Заказ оформлен, с вами свяжется менеджер"};
//  console.log(result);

// total = 100;

// ordered = 20;
// if (100 < 20) {
//   result = "На складе недостаточно твоаров!";
// } else {result = "Заказ оформлен, с вами свяжется менеджер"};
// console.log(result);

// ordered = 80;
// if (100 < 80) {
//   result = "На складе недостаточно твоаров!";
// } else {result = "Заказ оформлен, с вами свяжется менеджер"};
// console.log(result);

// ordered = 130;
// if (100 < 130) {
//   result = "На складе недостаточно твоаров!";
// } else {result = "Заказ оформлен, с вами свяжется менеджер"};
// console.log(result);
